{
    "start": {
      "name": "Pallet Town",
      "description": "Your name is Ash. You have just landed in Pallet Town: a coastal town on an island well-known for its diversity of Pokemon, the first stop for all aspiring Pokemon trainers in the Kanto region. \nThe island is surrounded by a beautiful ocean, and the sun is shining brightly. You see a few houses and a small lab in the distance.", 
      "dialogue": "Go north to Professor Oak's lab.",
      "exits": {
        "north": "pol"
      },
      "items": []

    },
    "bruh": {
      "name": "Pallet Town",
      "description": "Why are you back here? Hurry and go back north to Professor Oak's lab!",
      "dialogue": "",
      "exits": {
        "north": "pol"
      },
      "items": []
    },
    "pol": {
      "name": "Professor Oak's Lab",
      "description": "Filled with pieces of research equipment you could never name, the lab of Professor Oak is humming with a low note. Professor Oak sits at his desk, awaiting your arrival.",
      "dialogue":  "Hello Ash! You seem ready to start your journey. I've been awaiting a new trainer for a very long time. I believe you are ready to choose your first Pokemon. You can choose between Bulbasaur, Charmander, or Squirtle.",
      "exits":{
        "north": "town north",
        "south": "bruh"
      },
      "items": [
        {
          "id": "p1",
          "name": "Pokeball",
          "description": "A red and white standard Pokeball."
        }
      ]
    },
    "town north": {
      "name": "Pallet Town North",
      "description": "You are in the northern part of Pallet Town. The houses here are a bit more spaced out, and there is a forked path. The sign pointing west says \"Grassy Forest\" and the sign pointing east says \"Whirlpool Beach\". Professor Oak's Lab is behind you to the south.",
      "dialogue": "",
      "exits": {
        "west": "forestclearing",
        "east": "beachsouth",
        "south": "pol"
      },
      "items": []
    },
    "forestclearing": {
      "name": "Forest Clearing",
      "description": "You are in a clearing in the forest, lush grass under your feet. The trees are tall and thick, and the air is filled with the sounds of chirping Pokemon. You can see a path leading deeper into the forest.",
      "dialogue": "You can go north to enter forest or south back to the lab.",
      "exits": {
        "north": "deeperforest",
        "south": "pol"
      },
      "items": []
    },
    "forestmiddle": {
      "name": "Middle of the Forest",
      "description": "You are inside the forest. The trees are dense, and your path is narrow. You can hear the sounds of hidden yet watchful Pokemon all around you. A path leads south back to the clearing.",
      "dialogue": "You can go south back to the clearing.",
      "exits": {
        "south": "forestclearing",
        "north": "forestnorth"
      },
      "items": []
    },
    "forestnorth": {
      "name": "Northern Forest",
      "description": "You are at the northern end of the forest. The trees are getting sparse, and the chirping of Pokemon seems almost absent. A mysterious path leads east, seemingly out of the forest. You can also return south back to the middle of the forest.",
      "dialogue": "You can go east deeper into the woods, or south back to the middle of the forest.",
      "exits": {
        "south": "forestmiddle",
        "east": "volcanowest"
      },
      "items": []
    },
    "beachsouth": {
      "name": "Whirlpool Beach South",
      "description": "You come to the beach. The waves are crashing against the shore, and a few Pokemon are playing in the water. A path leads southwest back to the town.",
      "dialogue": "You can go west back to the town.",
      "exits": {
        "west": "town north"
      },
      "items": []
    },
    "beachmiddle": {
      "name": "Whirlpool Beach Middle",
      "description": "You are in the middle of Whirlpool Beach. The water is calm here, and the Pokemon are easier to see now. A path leads east back to the south of the beach.",
      "dialogue": "You can go east back to the south of the beach.",
      "exits": {
        "south": "beachsouth",
        "north": "beachnorth"
      },
      "items": []
    },
    "beachnorth": {
      "name": "Whirlpool Beach North",
      "description": "You are at the northern end of Whirlpool Beach. The water is deeper here. A mysterious path through impenetrable woods leads west, and a path leads south back to the middle of the beach.",
      "dialogue": "You can go west through the woods, or south back to the middle of the beach.",
      "exits": {
        "south": "beachmiddle",
        "west": "volcanoeast"
      },
      "items": []
    },
    "volcanoeast": {
      "name": "Volcano East",
      "description": "Emerging from the woods, a giant volcano looms into view. The ground before you is rocky and uneven; the air is hot and filled with a putrid smell. You recognize this as the famous Cinnabar Volcano, known for its fiery Pokemon and treacherous terrain. Go west onto the volcano, or go east back to the beach.",
      "dialogue": "You can go west onto the volcano, or east back to the beach.",
      "exits": {
        "north": "volcanocave",
        "east": "beachnorth"
      },
      "items": []
    },
    "volcanowest": {
      "name": "Volcano West",
      "description": "Emerging from the woods, a giant volcano looms into view. The ground before you is rocky and uneven; the air is hot and filled with a putrid smell. You recognize this as the famous Cinnabar Volcano, known for its fiery Pokemon and treacherous terrain. Go east onto the volcano, or go west back to the forest.",
      "dialogue": "You can go south back to the northern forest.",
      "exits": {
        "west": "forestnorth"
      },
      "items": []
    },
    "volcanocaves": {
      "name": "Volcano Caves",
      "description": "You enter a dark cave inside the volcano. The walls are hot to the touch, and you can hear the sound of bubbling lava nearby. The air is thick with smoke, and you can see faint glowing rocks in the distance.",
      "dialogue": "You can go south back to the volcano east.",
      "exits": {
        "west": "volcanowest",
        "east": "volcanoeast"
      },
      "items": []
    }

  }
  